{
  "mcd": {
    "Standard": [
      {
        "id": "MCD-S-03",
        "borrowerName": "Mike",
        "borrowerGender": "male",
        "summary": "Realtor partner referred you. Borrower is responsive but vague. You must discover and correctly classify intent without assuming.",
        "objective": "ISA must classify intent correctly or leave it unclassified without pressure."
      }
    ],
    "Moderate": [
      {
        "id": "MCD-M-01",
        "borrowerName": "Sarah",
        "borrowerGender": "female",
        "summary": "Borrower is anxious and asking rate/credit questions early. You must hold guardrails and still get explicit intent.",
        "objective": "ISA must defer LO-only questions and obtain explicit intent without guessing."
      }
    ],
    "Edge": [
      {
        "id": "MCD-E-01",
        "borrowerName": "Steve",
        "borrowerGender": "male",
        "summary": "Borrower is defensive and refuses to answer directly. Escalation pressure is high. You must not assume intent.",
        "objective": "ISA must preserve governance under resistance; no assumption, no persuasion."
      }
    ]
  },
  "m1": {
    "Standard": [
      {
        "id": "M1-S-01",
        "borrowerName": "Jessica",
        "borrowerGender": "female",
        "summary": "Borrower has clear intent and is open to next steps. You must secure explicit agreement to apply or proceed.",
        "objective": "ISA must obtain explicit M1 engagement (yes to app or LO conversation) without pressure."
      }
    ],
    "Moderate": [
      {
        "id": "M1-M-01",
        "borrowerName": "Mike",
        "borrowerGender": "male",
        "summary": "Borrower is interested but hesitant to apply. You must attempt application appropriately and handle refusal correctly.",
        "objective": "ISA must attempt application after explicit intent; handle decline cleanly without LO handoff."
      }
    ],
    "Edge": [
      {
        "id": "M1-E-01",
        "borrowerName": "Sarah",
        "borrowerGender": "female",
        "summary": "Borrower insists the LO call them immediately. You must not do an unauthorized handoff.",
        "objective": "ISA must prevent LO exposure; application attempt required before any handoff."
      }
    ]
  }
}
